Repository: elnemerakhmed/UCASecurity
Catalog: UCASecurity.Web/Resources/SharedResource.*.resx
Languages: ar

# Algorithms_AES_Title
source: AES
ar: خوارزمية AES

# Algorithms_BlowFish_Title
source: BlowFish
ar: خوارزمية Blow Fish

# Algorithms_Caesar_Title
source: Caesar Cipher
ar: شيفرة القيصر

# Algorithms_DES_Title
source: DES
ar: خوارزمية DES

# Algorithms_GenerateRSAKeyPair_Title
source: Generate RSA Key Pair
ar: توليد مفاتيح تشفير جديدة لخوارزمية RSA

# Algorithms_PlayFair_Title
source: Play Fair
ar: خوارزمية Play Fair

# Algorithms_RailFence_Title
source: Rail Fence
ar: خوارزمية Rail Fence

# Algorithms_RC2_Title
source: RC2
ar: خوارزمية RC2

# Algorithms_RSA_Title
source: RSA Algorithm
ar: خوارزمية RSA

# Algorithms_Vigenare_Title
source: Vigenare
ar: خوارزمية Vigenare

source: Cipher
ar: الشيفرة

source: Error
ar: خطأ

# Functions_Hash_Message
source: To learn more about hashes click
ar: لتعلم المزيد أنقر

# Functions_Hash_Title
source: Hash Functions
ar: حساب قيمة Hash

# Functions_Hash_URL
source: here
ar: هنا

# Hash_MD5
source: MD5 Hash
ar: هاش MD5

# Hash_RIPMED160
source: RIPMED160 Hash
ar: هاش RIPMED160

# Hash_SHA1
source: SHA1 Hash
ar: هاش SHA1

# Hash_SHA256
source: SHA256 Hash
ar: هاش SHA256

# Hash_SHA512
source: SHA512 Hash
ar: هاش SHA512

# Hash_Text
source: Please enter the text you want to hash
ar: أدخل النص المراد حساب قيمة الهاش له من فضلك

# Hash_Tiger
source: Tiger Hash
ar: هاش Tiger

# Hash_Whirlpool
source: Whirlpool Hash
ar: هاش Whirlpool

# Home_Advanced
source: Advanced Algorithms
ar: الخوارزميات المتقدمة

# Home_Asymmetric
source: Asymmetric Encryption
ar: خوارزميات التشفير Asymmetric

# Home_Classic
source: Classical Encryption Algorithms
ar: خوارزميات التشفير الكلاسيكية

# Home_Features_Title
source: Features
ar: المميزات

# Home_Feature_A
source: Accessibility, students can interact with our tool anywhere.
ar: سهولة الوصول، يمكن للطلاب التفاعل معها من أي مكان.

# Home_Feature_B
source: Free and Open source, its source code available on
ar: مجانية ومفتوحة المصدر، الكود متوافر على

# Home_Feature_C
source: All-in-one, no need for extra software installation.
ar: تجمع كل الخوارزميات في برنامج واحد، لذلك لا حاجة لبرامج اضافية.

# Home_Hash
source: Hash Algorithms
ar: خوارزميات حساب Hash

# Home_Hero_Description
source: A new generation of cloud enryption online tool for educational purpuses, developed as a graduation project for Cryptography II Course.
ar: الجيل الجديد من أدوات التشفير السحابية ذات الاستخدام التعليمي, تم تطويرها كمشروع لمساق التشفير المتقدم

# Home_Hero_Title
source: UCAS Crypto Tool
ar: أداة يوكاس كريبتو

# Home_Index_Title
source: Home Page
ar: الصفحة الرئيسية

# Home_Math
source: Math Utilities
ar: أدوات رياضية مساعدة

# Home_Symmetric
source: Symmetric Encryption
ar: خورازميات التشفير Symmetric

# Home_Team_Ahmed
source: Eng. Ahmed El Nemer
ar: م. أحمد النمر

# Home_Team_Ahmed_BIO
source: Web & Blockchain Developer, RUS team member and ISE
ar: مطور تطبيقات ويب و بلوكتشين ومهندس أمن معلومات

# Home_Team_Description
source: Meet the team
ar: تعرف على فريق العمل

# Home_Team_Etaf
source: Eng. Etaf Abu Hadda
ar: م. عطاف أبو هدة

# Home_Team_Etaf_BIO
source: Web developer, RUS team CEO and ISE
ar: مطورة تطبيقات ويب, مؤسسة فريق RUS وطالبة هندسة أمن المعلومات

# Home_Team_Hala
source: Eng. Hala Abu Sada
ar: م. هلا أبو سعدة

# Home_Team_Hala_BIO
source: Web developer, RUS team CEO and ISE
ar: مطورة تطبيقات ويب, مؤسسة فريق RUS وطالبة هندسة أمن المعلومات

# Home_Team_Title
source: Who Are we?
ar: من نحن؟

# Home_Tools_Title
source: Tools
ar: الأدوات

# Layout_About
source: About
ar: من نحن

# Layout_Algorithms
source: Algorithms
ar: الخوارزميات

# Layout_Brand
source: UCAS Crypto Tool
ar: أداة يوكاس كريبتو

# Layout_Footer
source: UCAS 2021
ar: يوكاس 2021

# Layout_Home
source: Home
ar: الرئيسية

# Learn_AES
source: AES ( Advanced Encryption Standard) Algorithm, established by NIST as a symmetric encryption algorithm, it’s considered as a secure algorithm due to its key length. all of AES operations are performed on 8-bit bytes. In particular, the arithmetic operations of addition, multiplication, and division are performed over the finite field GF(28), The cipher takes a plaintext block size of 128 bits, or 16 bytes. The key length can be 16, 24, or 32 bytes (128, 192, or 256 bits). The algorithm is referred to as AES-128, AES-192, or AES-256, depending on the key length. Each round has it’s new generated key.
ar: معيار التشفير المتقدم ( Advanced Encryption Standard)‏، هو طريقة تشفير متماثل رسمية تبنتها NIST، تُعتبر طريقة آمنة للتشفير وذلك بسبب طول مفتاح التشفير. هذه الخوارزمية هي تطوير لأفكار ظهرت في DES، تعتمد على نفس المفتاح في عمليتي التشفير وفك التشفير. تشفر الخوارزمية نص طوله 128 بت أو 16 بايت، ويختلف مفتاح التشفير حسب الحاجة حيث يمكن أن يكون 16 أو 24 أو 32 بايت (128، 192، 256) بت. وتسمى حسب طول مفتاح التشفير، مثال AES-192 أي أن مفتاح التشفير يساوي 192 بت، تتكون من أربع خطوات أساسية وهي عملية الاستبدال، عملية الازاحة، خلط الأعمدة، اضافة مفتاح الدورة، كل دورة لها مفتاحها الخاص.

# Learn_BlowFish
source: Blowfish is an encryption technique designed by Bruce Schneier in 1993 as an alternative to DES Encryption Technique. It is significantly faster than DES and provides a good encryption rate with no effective cryptanalysis technique found until now. It is one of the first, secure block ciphers not subject to any patents and hence freely available for anyone to use. in Blowfish the blockSize is 64-bits and the keySize is 32-bits.
ar: Blowfish هي تقنية تشفير صممها Bruce Schneier في عام 1993 كبديل لتقنية التشفير DES. تعتبر أسرع من DES وتوفر معدل تشفير جيد مع عدم وجود تقنية تحليل تشفير فعالة حتى الآن. تعتبر واحدة من أوائل خوارزميات التشفير الآمنة التي لا تخضع لأي براءات اختراع وبالتالي فهي متاحة مجانًا لأي شخص لاستخدامها. في Blowfish ، يكون حجم الكتلة النصية 64 بت وحجم المفتاح هو 32 بت.

# Learn_Caesar
source: Caesar cipher is a classic example of ancient cryptography and is said to have been used by Julius Caesar. The Caesar cipher is based on transposition and involves shifting each letter of the plaintext message by a certain number of letters and it’s the key of the cipher. The ciphertext can be decrypted by applying the same number of shifts in the opposite direction. This type of encryption is known as a substitution cipher, due to the substitution of one letter for another in a consistent fashion.
ar: تعد شيفرة القيصر من أقدم أنواع التشفير، ويقال أنه استخدمها القيصر يوليوس. تعتمد هذه الشيفرة على الإزاحة، حيث يتم إزاحة كل حرف من الرسالة الأصلية بعدد معين من الحروف وهو مفتاح التشفير. يمكن فك تشفير النص المشفر بتطبيق نفس عدد الإزاحات في الاتجاه المعاكس. تصنف هذه الخوارزمية من شيفرات الاستبدال (substitution cipher) ، بسبب استبدال حرف واحد بآخر بطريقة متسقة.

# Learn_DES
source: The DES (Data Encryption Standard) algorithm is a symmetric-key block cipher created in the early 1970s by an IBM team and adopted by the (NIST). that was the most widely used encryption scheme. Before the publishing of AES, The algorithm takes the plain text in 64-bit blocks and converts them into ciphertext using 48-bit keys. it depends essentially on permutations.
ar: DES هي خوارزمية تشفير تماثل، تعتبر من أكثر الخوارزميات استعمالًا قبل ظهور AES، تأخذ الخوارزمية مدخلين الأول: النص المراد تشفيره والثاني هو المفتاح، في DES يجب أن يكون طول النص 64 بت وطول المفتاح 48 بت. تعتمد بشكل أساسي على التبديل والتقليب في التشفير.

# Learn_GCD
source: it calculates the Great Common Divisor between two integers.
ar: تقوم هذه الخوارزمية بحساب العامل المشترك الأكبر بين رقمين صحيحين

# Learn_Hash
source: it calculates different hashes for specific text,MD5 Hash, RIPEMD 160 Hash, SHA1, SHA256,SHA512, Tiger Hash,Whirlpool Hash, the user provides specific text to calculate hashes for it .
ar: تقوم بحساب قيمة الهاش لنص معين، حيث يقوم المستخدم بإضافة النص ويقوم البرنامج بطباعة الهاش بقيمه المختلفة

# Learn_PasswordStrength
source: this algorithm calculates how strong your password is, you have to provide your password and it will display a percent, the perfect password contains lower and upper case letters, numbers, Non Alphabetical Characters, and it's length equal or more than eight characters.
ar: تقوم هذه الخوارزمية بتقييم قوة كلمة المرور، حيث يجب عليك تزويدها بكلمة المرور وستقوم بفحصها وطبعا نسبة على الشاشة تبين مدى قوة هذه الكلمة، كلمة المرور الجيدة تتكون من حروف كبيرة وصغيرة وأرقام ورموز خاصة وطولها أكبر أو يساوي ثمانية أحرف

# Learn_PlayFair
source: The Playfair cipher (Playfair square) is a type of substitution cipher used for the encryption of data & Introduced in 1854. It involved the use of keys that arrange alphabetical letters in geometric patterns in order to encode messages that we encrypt a pair of alphabets(digraphs) instead of a single alphabet.
ar: خوارزمية Playfair هي نوع من شيفرات الاستبدال المستخدمة لتشفير البيانات. تم تقديمها في عام 1854، وقد اشتملت على استخدام المفاتيح التي ترتب الحروف الأبجدية في أنماط هندسية من أجل تشفير الرسائل. يتم تشفير زوج من الحروف الهجائية في كل مرة بدلاً من تشفير حرف واحد

# Learn_PrimeFactorization
source: it calculates the prime factors of the given number, and calculate it as multiplied numbers.
ar: تقوم هذه الخوارزمية بحساب العوامل الأولية للرقم المعطى ، ويطبع العوامل بصيغة الضرب

# Learn_RailFence
source: Rail Fence cipher is a transposition cipher that the plaintext is written downwards and diagonally on successive rails of an imaginary fence. When we reach the bottom rail, we traverse upwards moving diagonally, after reaching the top rail, the direction is changed again. Thus the alphabets of the message are written in a zig-zag manner. After each alphabet has been written, the individual rows are combined to obtain the cipher-text.
ar: خوارزمية RailFence من شيفرات التحويل (Transposition) حيث يتم كتابة النص الأصلي لأسفل وقطريًا على قضبان متتالية من السياج الوهمي. عندما نصل إلى السكة السفلية ، نتحرك صعودًا قطريًا ، وبعد الوصول إلى السكة العلوية ، يتغير الاتجاه مرة أخرى. وهكذا تتم كتابة الحروف الهجائية للرسالة بطريقة متعرجة. بعد الانتهاء من الكتابة، يتم دمج الصفوف الفردية للحصول على نص مشفر.

# Learn_RC2
source: RC2 (also known as ARC2) is a symmetric-key block cipher designed by Ron Rivest in 1987. "RC" stands for "Ron's Code" or "Rivest Cipher"; The block size is 8 bytes (64 bits). The input data is divided into blocks of 8 bytes and then each of them is processed separately. RC2 depends on two core rounds, Mixing and Mashing Rounds. Now, RC2 is vulnerable to a related-key attack using 234 chosen plaintexts
ar: RC2 هي خوارزمية تشفير متماثلة المفتاح، تعرف أيضًا باسم ARC2، تم تصميمها بواسطة Ron Rivest في 1987، حجم الكتلة يساوي 8 بايت، حيث يتم تقسيم النص المدخل إلى كتل من 8 بايت، ثم يتم معالجة كل كتلة بشكل منفرد، RC2 تعتمد بشكل أساسي على عمليتي الخلط والهرس 😂😂 في الوقت الحالي أصبحت RC2 ضعيفة أمام بعض الهجمات.

# Learn_RSA
source: The RSA algorithm is the basis of a cryptosystem which enables asymmetric encryption and is widely used to secure sensitive data, particularly when it is being sent over an insecure network such as the internet. RSA was first publicly described in 1977 by Ron Rivest, Adi Shamir and Leonard Adleman of the Massachusetts Institute of Technology, through the 1973 creation of a public key algorithm. Public key cryptography, uses two different but mathematically linked keys (one public and one private). The public key can be shared with everyone, whereas the private key must be kept secret. In RSA cryptography, both the public and the private keys can encrypt a message; the opposite key from the one used to encrypt a message is used to decrypt it. This attribute is one reason why RSA has become the most widely used asymmetric algorithm: It provides a method to assure the confidentiality, integrity, authenticity, and non-repudiation of electronic communications and data storage.
ar: تعد خوارزمية RSA من خوارزميات التشفير غير المتماثل ويستخدم على نطاق واسع لتأمين البيانات الحساسة ، لا سيما عندما يتم إرسالها عبر شبكة غير آمنة مثل الإنترنت. تم وصف RSA علنًا لأول مرة في عام 1977 من قبل Ron Rivest و Adi Shamir و Leonard Adleman من معهد ماساتشوستس للتكنولوجيا ، من خلال إنشاء خوارزمية Public Key عام 1973. يستخدم تشفير public key مفتاحين مختلفين ولكنهما مرتبطان رياضياً (أحدهما عام والآخر خاص). يمكن مشاركة المفتاح العام مع الجميع ، بينما يجب أن يظل المفتاح الخاص سراً. في تشفير RSA ، يمكن للمفاتيح العامة والخاصة تشفير رسالة ؛ يتم استخدام المفتاح المعاكس من المفتاح المستخدم لتشفير الرسالة لفك تشفيرها. هذه السمة هي أحد الأسباب التي جعلت RSA الأكثر استخدامًا، فهي توفر طريقة لضمان سرية الاتصالات الإلكترونية وتخزين البيانات وسلامتها ومصداقيتها وعدم رفضها.

# Learn_Vigenare
source: Vigenère cipher is a type of substitution cipher invented by the 16th-century French cryptographer Blaise de Vigenère and used for data encryption in which the original plaintext structure is somewhat concealed in the ciphertext by using several different monoalphabetic substitution ciphers rather than just one.The key specifies which particular substitution is to be employed for encrypting each letter in the plaintext.
ar: تعد خوارزمية Vigenère نوع من شيفرات الاستبدال (substitution cipher) التي اخترعها عالم التشفير الفرنسي في القرن السادس عشر Blaise de Vigenère واستخدمت لتشفير البيانات حيث يتم إخفاء بنية النص الأصلي إلى حد ما في النص المشفر باستخدام عدة شفرات استبدال مختلفة بدلاً من واحدة فقط ؛ يحدد مفتاح التشفير طريقة الاستبدال التي سيتم تطبيقها لتشفير كل حرف من حروف النص الأصلي.

# Math_GCD_Input_1
source: First Number
ar: العدد الأول

# Math_GCD_Input_2
source: Second Number
ar: العدد الثاني

# Math_GCD_Result
source: Result
ar: النتيجة

# Math_GCD_Title
source: GCD
ar: العامل المشترك الأكبر

# Math_PasswordStrength_Input
source: Password
ar: كلمة المرور

# Math_PasswordStrength_Result
source: Result
ar: النتيجة

# Math_PasswordStrength_Title
source: Password Strength Calculator
ar: حاسبة قوة كلمات المرور

# Math_PrimeFactorization_Title
source: Prime Factorization
ar: العوامل الرئيسية

# Math_PrimeTest_False
source: False
ar: خطأ

# Math_PrimeTest_Input
source: Input
ar: الرقم

# Math_PrimeTest_Result
source: Result
ar: النتيجة

# Math_PrimeTest_Title
source: Prime Test
ar: فحص العدد الأولي

# Math_PrimeTest_True
source: True
ar: صحيح

# PrimeFactorization_Input
source: Input
ar: الرقم

# PrimeFactorization_Result
source: Result
ar: النتيجة

source: Result
ar: النتيجة

# RSA_Alert_Text
source: If don't have keys yet
ar: إذا كنت لا تمتلك مفاتيح التشفير وفك التشفير

# RSA_Alert_URL_Text
source: Click here to generate key pair
ar: أنقر هنا لإنشاء زوج مفاتيح تشفير

# RSA_Cipher
source: Cipher
ar: النص المراد فك تشفيره

# RSA_CipherResult
source: Result
ar: نتيجة التشفير

# RSA_PrivateKey
source: Private Key
ar: مفتاح التشفير الخاص

# RSA_PublicKey
source: Public Key
ar: مفتاح التشفير العام

# RSA_Text
source: Text
ar: النص المراد تشفيره

# RSA_TextResult
source: Result
ar: نتيجة فك التشفير

# Symmetric_Key
source: Encryption / Decryption key
ar: مفتاح التشفير / فك التشفير

# Symmetric_Mode
source: Mode
ar: الوضع

# Symmetric_Select_Mode
source: Please select an algorithm mode
ar: من فضلك إختر الوضع

source: Text
ar: النص
